# Домашнее задание 4

Максимальный балл за домашнюю работу 10.
Необходимо выполнять все задания в ноутбуке с помощью чистого SQL и SQLAlchemy ORM:
- осуществить подключение к БД
- каждое задание оформить в отдельной ячейке
- результат выполнения запросов записать в pandas dataframe

## Задание 1 (1 балл)

Сформируйте упорядоченный список из первых 10 фамилий в таблице участников?  
Список не должен содержать дубликатов.

сначала чистый SQL

импортирую либы

In [1]:
import psycopg2
from urllib.parse import urlparse
import pandas as pd
from IPython.display import display

моя ссылочка к neon.tech

In [2]:
url = "postgresql://18.3071:f5KrOjmopn6I@ep-cool-grass-a2mljg6r.eu-central-1.aws.neon.tech/club?sslmode=require"

распарсиваю её на креденшалс

In [3]:
result = urlparse(url)
username = result.username
password = result.password
database = result.path[1:]
hostname = result.hostname
port = result.port

смотрю, что получилось

In [4]:
print(f'Host: {hostname}')
print(f'Port: {port}')
print(f'Database: {database}')
print(f'User: {username}')
print(f'Password: {password}')

Host: ep-cool-grass-a2mljg6r.eu-central-1.aws.neon.tech
Port: None
Database: club
User: 18.3071
Password: f5KrOjmopn6I

создаю соединение к БД при помощи psycopg2

In [5]:
connection = psycopg2.connect(
    database = database,
    user = username,
    password = password,
    host = hostname,
    port = port
)

In [6]:
cursor = connection.cursor()

текст запроса

похоже, участник с memid = 0 - это просто тестовая (первая строка) при наполнении таблицы, и такого человека в реальности нет, поэтому дропну

In [7]:
sql = '''
SELECT DISTINCT surname
FROM club.cd.members m
where memid != 0
ORDER BY surname
limit 10
'''

In [8]:
cursor.execute(sql)
result = cursor.fetchall()

смотрим результат

In [9]:
for res in result:
    print(res[0])

Bader
Baker
Boothe
Butters
Coplin
Crumpet
Dare
Farrell
Genting
Hunt

теперь то же самое с SQLAlchemy

создаю соединение

In [10]:
from sqlalchemy import create_engine
from sqlalchemy.schema import MetaData

engine = create_engine(url, echo=False)
metadata_obj = MetaData()
metadata_obj.reflect(engine)

for table_name in metadata_obj.tables:
    print(table_name)

что-то нет никаких таблиц

In [11]:
from sqlalchemy import inspect
inspectation = inspect(engine)
inspectation.get_schema_names()

['cd', 'information_schema']

ага, схему надо как-то указать

In [12]:
schema_name = 'cd'
metadata_obj = MetaData(schema = schema_name)
metadata_obj.reflect(engine)

for table_name in metadata_obj.tables:
    print(table_name)

cd.facilities
cd.bookings
cd.members

загружаю данные о таблицах

In [13]:
from sqlalchemy import Table

tables = {}
for table_name in metadata_obj.tables:
    t_name = table_name[len(schema_name) + 1: ]
    tables[t_name] = Table(t_name, metadata_obj, autoload=True)

In [14]:
from sqlalchemy import select

sql_query = select(tables['members'].c['surname']).distinct()
sql_query = sql_query.where(tables['members'].c.memid != 0)
sql_query = sql_query.order_by(tables['members'].c['surname']).limit(10)
print(sql_query)

SELECT DISTINCT cd.members.surname
FROM cd.members
WHERE cd.members.memid != :memid_1 ORDER BY cd.members.surname
 LIMIT :param_1

в документации описан какой-то хитрый способ отправки запроса через Session

In [15]:
from sqlalchemy.orm import Session

with Session(engine) as session:
    result = session.execute(sql_query).fetchall()

for res in result:
    print(res[0])

Bader
Baker
Boothe
Butters
Coplin
Crumpet
Dare
Farrell
Genting
Hunt

## Задание 2  (1 балл)

Выведите имя и фамилию последнего зарегистрировавшегося участника, а также дату.

чистый SQL

In [16]:
sql = '''
select firstname, surname, joindate 
from club.cd.members
order by joindate desc
limit(1)
'''

cursor.execute(sql)
result = cursor.fetchall()

print(result)

[('Darren', 'Smith', datetime.datetime(2012, 9, 26, 18, 8, 45))]

SQLAlchemy

In [17]:
sql_query = select(
    tables['members'].c.firstname, 
    tables['members'].c.surname,
    tables['members'].c.joindate
)
sql_query = sql_query.order_by(tables['members'].c.joindate.desc())
sql_query = sql_query.limit(1)
with Session(engine) as session:
    result = session.execute(sql_query).fetchall()
print(result)

[('Darren', 'Smith', datetime.datetime(2012, 9, 26, 18, 8, 45))]

## Задание 3 (2 балла)

Составьте список времени начала бронирования теннисных кортов на дату "2012-09-21".  
В итоговой выборке верните список пар времени начала и названий объектов, упорядоченных по времени.

In [18]:
sql = '''
select b.starttime, f.name
from club.cd.bookings b
join club.cd.facilities f
on b.facid = f.facid
where starttime >= '2012-09-21' and starttime < '2012-09-22'
order by b.starttime
'''

cursor.execute(sql)
result = cursor.fetchall()

pd_res = pd.DataFrame(result, columns = ['starttime', 'fac name'])
display(pd_res)

             starttime        fac name
0  2012-09-21 08:00:00  Tennis Court 1
1  2012-09-21 08:00:00  Tennis Court 2
2  2012-09-21 08:30:00  Massage Room 1
3  2012-09-21 08:30:00   Snooker Table
4  2012-09-21 08:30:00      Pool Table
..                 ...             ...
64 2012-09-21 19:00:00   Snooker Table
65 2012-09-21 19:00:00      Pool Table
66 2012-09-21 19:30:00    Table Tennis
67 2012-09-21 19:30:00  Massage Room 1
68 2012-09-21 19:30:00      Pool Table

[69 rows x 2 columns]

In [19]:
from sqlalchemy import and_
sql_query = select(
    tables['bookings'].c.starttime, 
    tables['facilities'].c.name
)
sql_query = sql_query.join(tables['facilities'])
sql_query = sql_query.where(and_(
    tables['bookings'].c.starttime >= '2012-09-21',
    tables['bookings'].c.starttime < '2012-09-22'
))
sql_query = sql_query.order_by(tables['bookings'].c.starttime)

with Session(engine) as session:
    result = session.execute(sql_query).fetchall()

pd_res = pd.DataFrame(result, columns = ['starttime', 'fac name'])
display(pd_res)

             starttime        fac name
0  2012-09-21 08:00:00  Tennis Court 1
1  2012-09-21 08:00:00  Tennis Court 2
2  2012-09-21 08:30:00  Massage Room 1
3  2012-09-21 08:30:00   Snooker Table
4  2012-09-21 08:30:00      Pool Table
..                 ...             ...
64 2012-09-21 19:00:00   Snooker Table
65 2012-09-21 19:00:00      Pool Table
66 2012-09-21 19:30:00    Table Tennis
67 2012-09-21 19:30:00  Massage Room 1
68 2012-09-21 19:30:00      Pool Table

[69 rows x 2 columns]

## Задание 4 (2 балла)

 Выведите список всех участников, включая человека, который их рекомендовал (если таковой имеется).  
 Убедитесь, что результаты упорядочены по (фамилия, имя).

тут не очень понятно, сколько столбцов должно быть на выходе, потому что человек, который рекомендовал (если таковой имеется), это всегда уже действующий член клуба, т.о. включать его в общий список участников нет смысла, он уже там

значит, похоже, надо делать 4 столбца, два для участника и два для рекомендовавшего его

In [20]:
sql = '''
select m.firstname, m.surname, 
	mm.firstname as recby_firstname, mm.surname as recby_surname
from club.cd.members m
left join club.cd.members mm
on m.recommendedby = mm.memid
where m.memid != 0
order by m.firstname, m.surname
'''

cursor.execute(sql)
result = cursor.fetchall()

pd_res = pd.DataFrame(result, columns = ['name', 'surname', 'rec_by_name', 'rec_by_surname'])
display(pd_res)

         name            surname rec_by_name rec_by_surname
0        Anna          Mackenzie      Darren          Smith
1        Anne              Baker      Ponder       Stibbons
2      Burton              Tracy        None           None
3     Charles               Owen      Darren          Smith
4      Darren              Smith        None           None
5      Darren              Smith        None           None
6       David            Farrell        None           None
7       David              Jones      Janice       Joplette
8       David             Pinker      Jemima        Farrell
9     Douglas              Jones       David          Jones
10      Erica            Crumpet       Tracy          Smith
11   Florence              Bader      Ponder       Stibbons
12     Gerald            Butters      Darren          Smith
13  Henrietta             Rumney     Matthew        Genting
14      Henry  Worthington-Smyth       Tracy          Smith
15   Hyacinth         Tupperware        None           None
16       Jack              Smith      Darren          Smith
17     Janice           Joplette      Darren          Smith
18     Jemima            Farrell        None           None
19       Joan             Coplin     Timothy          Baker
20       John               Hunt   Millicent        Purview
21    Matthew            Genting      Gerald        Butters
22  Millicent            Purview       Tracy          Smith
23      Nancy               Dare      Janice       Joplette
24     Ponder           Stibbons      Burton          Tracy
25  Ramnaresh             Sarwin    Florence          Bader
26        Tim             Boothe         Tim         Rownam
27        Tim             Rownam        None           None
28    Timothy              Baker      Jemima        Farrell
29      Tracy              Smith        None           None

In [21]:
m = tables['members'].alias()
mm = tables['members'].alias()

sql_query = select(
    m.c.firstname, m.c.surname, 
    mm.c.firstname, mm.c.surname,
)
sql_query = sql_query.join(mm, m.c.recommendedby == mm.c.memid, isouter = True)
sql_query = sql_query.where(m.c.memid != 0)
sql_query = sql_query.order_by(m.c.firstname, m.c.surname)
# print(sql_query)

with Session(engine) as session:
    result = session.execute(sql_query).fetchall()

pd_res = pd.DataFrame(result, columns = ['name', 'surname', 'rec_by_name', 'rec_by_surname'])
display(pd_res)

         name            surname rec_by_name rec_by_surname
0        Anna          Mackenzie      Darren          Smith
1        Anne              Baker      Ponder       Stibbons
2      Burton              Tracy        None           None
3     Charles               Owen      Darren          Smith
4      Darren              Smith        None           None
5      Darren              Smith        None           None
6       David            Farrell        None           None
7       David              Jones      Janice       Joplette
8       David             Pinker      Jemima        Farrell
9     Douglas              Jones       David          Jones
10      Erica            Crumpet       Tracy          Smith
11   Florence              Bader      Ponder       Stibbons
12     Gerald            Butters      Darren          Smith
13  Henrietta             Rumney     Matthew        Genting
14      Henry  Worthington-Smyth       Tracy          Smith
15   Hyacinth         Tupperware        None           None
16       Jack              Smith      Darren          Smith
17     Janice           Joplette      Darren          Smith
18     Jemima            Farrell        None           None
19       Joan             Coplin     Timothy          Baker
20       John               Hunt   Millicent        Purview
21    Matthew            Genting      Gerald        Butters
22  Millicent            Purview       Tracy          Smith
23      Nancy               Dare      Janice       Joplette
24     Ponder           Stibbons      Burton          Tracy
25  Ramnaresh             Sarwin    Florence          Bader
26        Tim             Boothe         Tim         Rownam
27        Tim             Rownam        None           None
28    Timothy              Baker      Jemima        Farrell
29      Tracy              Smith        None           None

## Задание 5 (2 балла)

Составьте список числа слотов забронированных по каждой услуге в сентябре 2012ого года.  

В выводе отобразите две колонки: `facid`, `Total Slots`, и отсортируйте по числу слотов.

In [22]:
sql = '''
select b.facid, sum(b.slots) as total_slots
from club.cd.bookings b
where b.starttime >= '2012-09-01' and b.starttime < '2012-10-01'
group by b.facid
order by total_slots
'''

cursor.execute(sql)
result = cursor.fetchall()

pd_res = pd.DataFrame(result, columns = ['facid', 'Total slots'])
display(pd_res)

   facid  Total slots
0      5          122
1      3          422
2      7          426
3      8          471
4      6          540
5      2          570
6      1          588
7      0          591
8      4          648

In [23]:
from sqlalchemy import func

b = tables['bookings'].alias()

sql_query = select(b.c.facid, func.sum(b.c.slots).label('total_sum'))
sql_query = sql_query.where(and_(
    b.c.starttime >= '2012-09-01',
    b.c.starttime < '2012-10-01'
))
sql
sql_query = sql_query.group_by(b.c.facid)
sql_query = sql_query.order_by('total_sum')
# print(sql_query)

with Session(engine) as session:
    result = session.execute(sql_query).fetchall()

pd_res = pd.DataFrame(result, columns = ['facid', 'Total slots'])
display(pd_res)

   facid  Total slots
0      5          122
1      3          422
2      7          426
3      8          471
4      6          540
5      2          570
6      1          588
7      0          591
8      4          648

## Задание 6 (2 балла)

Составьте список бронирований на день 2012-09-14, которые обойдутся участнику (или гостю) более чем в 30 долларов. Помните, что у гостя всегда идентификатор 0 и расходы гостей отличаются от расходов участников (расходы указаны за получасовой слот).

В выводе отобразите три колонки: `member`, `facility`, `cost` и отсортируйте по убыванию стоимости. В колонке `member` объединим имя и фамилию следующим образом:

`mems.firstname || ' ' || mems.surname as member`  
(в данном случае `mems` — это алиас на колонку `members`)

Не очень понял про "расходы указаны за получасовой слот". Вроде, там нигде нет разделения на получасовые и какие-то другие слоты. Так что буду считать, что все слоты одинаковы.

In [24]:
sql = '''
with 
	data1 as (
		select 
			m.memid, m.firstname || ' ' || m.surname as member, b.slots,
			f.name as facility, f.membercost, f.guestcost 
		from club.cd.bookings b
		join club.cd.members m
		on m.memid = b.memid
		join club.cd.facilities f
		on f.facid = b.facid
		where b.starttime >= '2012-09-14' and b.starttime < '2012-09-15'
	),
	members as (
		select member, facility, slots * membercost as cost
		from data1
		where memid != 0
	),
	guests as (
		select member, facility, slots * guestcost as cost
		from data1
		where memid = 0
	),
	costs as (
		select *
		from guests
		union all
		select *
		from members
	)
select *
from costs
where cost > 30
order by cost desc
'''

cursor.execute(sql)
result = cursor.fetchall()

pd_res = pd.DataFrame(result, columns = ['member', 'facility', 'cost'])
display(pd_res)

             member        facility  cost
0       GUEST GUEST  Massage Room 2   320
1       GUEST GUEST  Massage Room 1   160
2       GUEST GUEST  Massage Room 1   160
3       GUEST GUEST  Massage Room 1   160
4       GUEST GUEST  Tennis Court 2   150
5    Jemima Farrell  Massage Room 1   140
6       GUEST GUEST  Tennis Court 1    75
7       GUEST GUEST  Tennis Court 2    75
8       GUEST GUEST  Tennis Court 1    75
9    Jemima Farrell  Massage Room 1    70
10  Ponder Stibbons  Massage Room 1    70
11  Matthew Genting  Massage Room 1    70
12      GUEST GUEST    Squash Court  70.0
13       Jack Smith  Massage Room 1    70
14   Florence Bader  Massage Room 2    70
15     Burton Tracy  Massage Room 1    70
16      GUEST GUEST    Squash Court  35.0
17      GUEST GUEST    Squash Court  35.0

In [25]:
from sqlalchemy import union_all

b = tables['bookings'].alias()
m = tables['members'].alias()
f = tables['facilities'].alias()

data1 = select(
    m.c.memid,
    func.concat(m.c.firstname, ' ', m.c.surname).label('member'),
    b.c.slots,
    f.c.name.label('facility'),
    f.c.membercost,
    f.c.guestcost
)
data1 = data1.join(m, m.c.memid == b.c.memid)
data1 = data1.join(f, f.c.facid == b.c.facid)
data1 = data1.where(and_(
    b.c.starttime >= '2012-09-14',
    b.c.starttime < '2012-09-15'
))
data1 = data1.cte()

members = select(
    data1.c.member,
    data1.c.facility,
    (data1.c.slots * data1.c.membercost).label('cost')
)
members = members.where(data1.c.memid != 0)

guests = select(
    data1.c.member,
    data1.c.facility,
    (data1.c.slots * data1.c.guestcost).label('cost')
)
guests = guests.where(data1.c.memid == 0)

costs = union_all(guests, members).cte()

sql_query = select(costs).where(costs.c.cost > 30).order_by(costs.c.cost.desc())

with Session(engine) as session:
    result = session.execute(sql_query).fetchall()

pd_res = pd.DataFrame(
    result
)
display(pd_res)

             member        facility  cost
0       GUEST GUEST  Massage Room 2   320
1       GUEST GUEST  Massage Room 1   160
2       GUEST GUEST  Massage Room 1   160
3       GUEST GUEST  Massage Room 1   160
4       GUEST GUEST  Tennis Court 2   150
5    Jemima Farrell  Massage Room 1   140
6       GUEST GUEST  Tennis Court 1    75
7       GUEST GUEST  Tennis Court 2    75
8       GUEST GUEST  Tennis Court 1    75
9    Jemima Farrell  Massage Room 1    70
10  Ponder Stibbons  Massage Room 1    70
11  Matthew Genting  Massage Room 1    70
12      GUEST GUEST    Squash Court  70.0
13       Jack Smith  Massage Room 1    70
14   Florence Bader  Massage Room 2    70
15     Burton Tracy  Massage Room 1    70
16      GUEST GUEST    Squash Court  35.0
17      GUEST GUEST    Squash Court  35.0